# Exeptions
# Исключения (ошибки) - оюьекты, которые прерывают работу кода, если были вызваны

SyntaxError # исключение, кот выходит приситнаксич ошибке, скобочки там прочее
NameError # когда не обьявлена переменная
IndexError # когда обращ по несуществующ индексу
KeyError # когда обращ по несуществующ ключу
ValueError # когда колво жлементов или тип данных не совпадает 
TypeError # когда используем методы не те методы для какого-то типа данных
IndentationError # когда неправильно использ отступы
ZeroDivisionError # когда делим на ноль

# ОБРАБОТКА ИСКЛЮЧЕНИЙ
